<?php
    $a = 5; //เพิ่มค่า
    $b = 10; //ลดค่า

    //เพิ่มค่า
    echo "ค่าเริ่มต้นของ a = ".$a."<br>";//5
    echo "เพิ่มค่าแบบ Prefix = ".(++$a)."<br>";//6
    echo "ค่าล่าสุดของ a ".$a."<br>";//6

    echo "<hr>";

    echo "ค่าเริ่มต้นของ a = ".$a."<br>";//6
    echo "เพิ่มค่าแบบ Postfix = ".($a++)."<br>";//6
    echo "ค่าล่าสุดของ a ".$a."<br>";//7

    echo "<hr>";

    //ลดค่า
    echo "ค่าเริ่มต้นของ a = ".$b."<br>";//10
    echo "เพิ่มค่าแบบ Postfix = ".(--$b)."<br>";//9
    echo "ค่าล่าสุดของ a ".$b."<br>";//9

    echo "<hr>";

    echo "ค่าเริ่มต้นของ b = ".$b."<br>";//9
    echo "เพิ่มค่าแบบ Postfix = ".($b--)."<br>";//9
    echo "ค่าล่าสุดของ b ".$b."<br>";//8

    echo "<hr>";
?>